zeeman-effect/pixel-snap-voice/firmware/sdkconfig.defaults
# Pixel Snap Voice — ESP32-S3, no Wi-Fi in v1
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

CONFIG_PSV_BOARD_KORVO2=y
CONFIG_PSV_USB_MSC=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=512
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Native USB device (MSC). Korvo-2 native D+/D- are reserved; MSC is proven on the custom PCB.
CONFIG_TINYUSB=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192

# Keep BLE/Wi-Fi off. This accessory is a recorder, not a radio.
CONFIG_BT_ENABLED=n
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
